cases/chpt4-ice-pT-med/system/blockMeshDict
  /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices //-0.02
(
    (0 -0.5 0)
    (38 -0.5 0)
    (38 0.5 0)
    (0 0.5 0)
    (0 -0.5 38)
    (38 -0.5 38)
    (38 0.5 38)
    (0 0.5 38)

);
/*
vertices
(
    (0 -4.5 0)
    (9 -4.5 0)
    (9 4.5 0)
    (0 4.5 0)
    (0 -4.5 9)
    (9 -4.5 9)
    (9 4.5 9)
    (0 4.5 9)
);
//*/

blocks
(
    hex (0 1 2 3 4 5 6 7) allZone (76 1 76) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    hot
    {
        type wall;
        faces
        (
        (0 4 7 3)        
        );
    }
    cold
    {
        type wall;
        faces
        (
        (2 6 5 1)
        );
    }
    top
    {
        type patch;
        faces
        (
        (4 5 6 7)
        );
    }
    btm
    {
        type wall;
        faces
        (
        (0 3 2 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
        (3 7 6 2)
        (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
